name: "VGG_VOC0712_SSD_300x300_receptive_field_train"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    mirror: true
    mean_value: 104
    mean_value: 117
    mean_value: 123
    resize_param {
      prob: 1
      resize_mode: WARP
      height: 300
      width: 300
      interp_mode: LINEAR
      interp_mode: AREA
      interp_mode: NEAREST
      interp_mode: CUBIC
      interp_mode: LANCZOS4
    }
    emit_constraint {
      emit_type: CENTER
    }
  }
  data_param {
    source: "examples/VOC0712/VOC0712_trainval_lmdb"
    batch_size: 32
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
      max_sample: 1
      max_trials: 1
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.1
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.3
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.5
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.7
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        min_jaccard_overlap: 0.9
      }
      max_sample: 1
      max_trials: 50
    }
    batch_sampler {
      sampler {
        min_scale: 0.3
        max_scale: 1.0
        min_aspect_ratio: 0.5
        max_aspect_ratio: 2.0
      }
      sample_constraint {
        max_jaccard_overlap: 1.0
      }
      max_sample: 1
      max_trials: 50
    }
    label_map_file: "data/VOC0712/labelmap_voc.prototxt"
  }
}
layer {
  name: "conv1_1"
  type: "Convolution"
  bottom: "data"
  top: "conv1_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_1"
  type: "ReLU"
  bottom: "conv1_1"
  top: "conv1_1"
}
layer {
  name: "conv1_2"
  type: "Convolution"
  bottom: "conv1_1"
  top: "conv1_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 64
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu1_2"
  type: "ReLU"
  bottom: "conv1_2"
  top: "conv1_2"
}
layer {
  name: "pool1"
  type: "Pooling"
  bottom: "conv1_2"
  top: "pool1"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv2_1"
  type: "Convolution"
  bottom: "pool1"
  top: "conv2_1"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_1"
  type: "ReLU"
  bottom: "conv2_1"
  top: "conv2_1"
}
layer {
  name: "conv2_2"
  type: "Convolution"
  bottom: "conv2_1"
  top: "conv2_2"
  param {
    lr_mult: 0
    decay_mult: 0
  }
  param {
    lr_mult: 0
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu2_2"
  type: "ReLU"
  bottom: "conv2_2"
  top: "conv2_2"
}
layer {
  name: "pool2"
  type: "Pooling"
  bottom: "conv2_2"
  top: "pool2"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv3_1"
  type: "Convolution"
  bottom: "pool2"
  top: "conv3_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_1"
  type: "ReLU"
  bottom: "conv3_1"
  top: "conv3_1"
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_2"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_3"
  type: "Convolution"
  bottom: "conv3_2"
  top: "conv3_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu3_3"
  type: "ReLU"
  bottom: "conv3_3"
  top: "conv3_3"
}
layer {
  name: "pool3"
  type: "Pooling"
  bottom: "conv3_3"
  top: "pool3"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv4_1"
  type: "Convolution"
  bottom: "pool3"
  top: "conv4_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_1"
  type: "ReLU"
  bottom: "conv4_1"
  top: "conv4_1"
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_2"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_3"
  type: "Convolution"
  bottom: "conv4_2"
  top: "conv4_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu4_3"
  type: "ReLU"
  bottom: "conv4_3"
  top: "conv4_3"
}
layer {
  name: "pool4"
  type: "Pooling"
  bottom: "conv4_3"
  top: "pool4"
  pooling_param {
    pool: MAX
    kernel_size: 2
    stride: 2
  }
}
layer {
  name: "conv5_1"
  type: "Convolution"
  bottom: "pool4"
  top: "conv5_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_1"
  type: "ReLU"
  bottom: "conv5_1"
  top: "conv5_1"
}
layer {
  name: "conv5_2"
  type: "Convolution"
  bottom: "conv5_1"
  top: "conv5_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_2"
  type: "ReLU"
  bottom: "conv5_2"
  top: "conv5_2"
}
layer {
  name: "conv5_3"
  type: "Convolution"
  bottom: "conv5_2"
  top: "conv5_3"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu5_3"
  type: "ReLU"
  bottom: "conv5_3"
  top: "conv5_3"
}
layer {
  name: "pool5"
  type: "Pooling"
  bottom: "conv5_3"
  top: "pool5"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 1
    pad: 1
  }
}
layer {
  name: "fc6"
  type: "Convolution"
  bottom: "pool5"
  top: "fc6"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    pad: 6
    kernel_size: 3
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    dilation: 6
  }
}
layer {
  name: "relu6"
  type: "ReLU"
  bottom: "fc6"
  top: "fc6"
}
layer {
  name: "fc7"
  type: "Convolution"
  bottom: "fc6"
  top: "fc7"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 1024
    kernel_size: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "relu7"
  type: "ReLU"
  bottom: "fc7"
  top: "fc7"
}
layer {
  name: "conv6_1"
  type: "Convolution"
  bottom: "fc7"
  top: "conv6_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv6_1_relu"
  type: "ReLU"
  bottom: "conv6_1"
  top: "conv6_1"
}
layer {
  name: "conv6_2"
  type: "Convolution"
  bottom: "conv6_1"
  top: "conv6_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 512
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv6_2_relu"
  type: "ReLU"
  bottom: "conv6_2"
  top: "conv6_2"
}
layer {
  name: "conv7_1"
  type: "Convolution"
  bottom: "conv6_2"
  top: "conv7_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv7_1_relu"
  type: "ReLU"
  bottom: "conv7_1"
  top: "conv7_1"
}
layer {
  name: "conv7_2"
  type: "Convolution"
  bottom: "conv7_1"
  top: "conv7_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv7_2_relu"
  type: "ReLU"
  bottom: "conv7_2"
  top: "conv7_2"
}
layer {
  name: "conv8_1"
  type: "Convolution"
  bottom: "conv7_2"
  top: "conv8_1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 128
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv8_1_relu"
  type: "ReLU"
  bottom: "conv8_1"
  top: "conv8_1"
}
layer {
  name: "conv8_2"
  type: "Convolution"
  bottom: "conv8_1"
  top: "conv8_2"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 256
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv8_2_relu"
  type: "ReLU"
  bottom: "conv8_2"
  top: "conv8_2"
}
layer {
  name: "pool6"
  type: "Pooling"
  bottom: "conv8_2"
  top: "pool6"
  pooling_param {
    pool: AVE
    global_pooling: true
  }
}
layer {
  name: "conv4_3_norm"
  type: "Normalize"
  bottom: "conv4_3"
  top: "conv4_3_norm"
  norm_param {
    across_spatial: false
    scale_filler {
      type: "constant"
      value: 20
    }
    channel_shared: false
  }
}
layer {
  name: "conv4_3_norm_mbox_loc"
  type: "Convolution"
  bottom: "conv4_3_norm"
  top: "conv4_3_norm_mbox_loc"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 12
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv4_3_norm_mbox_loc_perm"
  type: "Permute"
  bottom: "conv4_3_norm_mbox_loc"
  top: "conv4_3_norm_mbox_loc_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv4_3_norm_mbox_loc_flat"
  type: "Flatten"
  bottom: "conv4_3_norm_mbox_loc_perm"
  top: "conv4_3_norm_mbox_loc_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv4_3_norm_mbox_conf"
  type: "Convolution"
  bottom: "conv4_3_norm"
  top: "conv4_3_norm_mbox_conf"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 63
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "xavier"
    }
    bias_filler {
      type: "constant"
      value: 0
    }
  }
}
layer {
  name: "conv4_3_norm_mbox_conf_perm"
  type: "Permute"
  bottom: "conv4_3_norm_mbox_conf"
  top: "conv4_3_norm_mbox_conf_perm"
  permute_param {
    order: 0
    order: 2
    order: 3
    order: 1
  }
}
layer {
  name: "conv4_3_norm_mbox_conf_flat"
  type: "Flatten"
  bottom: "conv4_3_norm_mbox_conf_perm"
  top: "conv4_3_norm_mbox_conf_flat"
  flatten_param {
    axis: 1
  }
}
layer {
  name: "conv4_3_norm_mbox_priorbox"
  type: "PriorBox"
  bottom: "conv4_3_norm"
  bottom: "data"
  top: "conv4_3_norm_mbox_priorbox"
  prior_box_param {
    aspect_ratio: 2
    flip: true
    clip: true
    variance: 0.1
    variance: 0.1
    variance: 0.2
    variance: 0.2
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 45
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 45
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 45
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 45
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 45
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 45
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 45
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 45
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 45
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 45
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 45
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 45
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 45
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 45
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 45
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 45
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 45
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 45
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 45
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 45
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 45
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 45
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 45
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 45
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 45
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 45
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 45
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 45
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 53
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 53
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 53
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 53
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 53
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 53
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 53
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 53
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 53
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 53
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 53
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 53
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 53
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 53
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 53
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 53
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 53
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 53
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 53
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 53
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 53
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 53
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 53
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 53
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 53
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 53
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 53
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 53
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 61
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 61
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 61
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 61
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 61
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 61
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 61
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 61
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 61
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 61
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 61
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 61
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 61
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 61
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 61
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 61
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 61
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 61
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 61
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 61
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 61
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 61
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 61
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 61
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 61
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 61
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 61
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 61
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 69
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 69
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 69
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 69
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 69
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 69
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 69
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 69
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 69
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 69
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 69
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 69
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 69
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 69
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 69
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 69
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 69
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 69
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 69
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 69
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 69
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 69
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 69
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 69
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 69
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 69
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 69
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 69
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 77
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 77
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 77
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 77
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 77
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 77
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 77
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 77
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 77
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 77
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 77
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 77
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 77
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 77
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 77
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 77
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 77
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 77
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 77
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 77
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 77
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 77
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 77
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 77
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 77
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 77
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 77
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 77
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 45
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 53
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 61
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 69
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 77
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 0
      xmax: 85
      ymax: 85
    }
    receptive_fields {
      xmin: 2
      ymin: 0
      xmax: 93
      ymax: 85
    }
    receptive_fields {
      xmin: 10
      ymin: 0
      xmax: 101
      ymax: 85
    }
    receptive_fields {
      xmin: 18
      ymin: 0
      xmax: 109
      ymax: 85
    }
    receptive_fields {
      xmin: 26
      ymin: 0
      xmax: 117
      ymax: 85
    }
    receptive_fields {
      xmin: 34
      ymin: 0
      xmax: 125
      ymax: 85
    }
    receptive_fields {
      xmin: 42
      ymin: 0
      xmax: 133
      ymax: 85
    }
    receptive_fields {
      xmin: 50
      ymin: 0
      xmax: 141
      ymax: 85
    }
    receptive_fields {
      xmin: 58
      ymin: 0
      xmax: 149
      ymax: 85
    }
    receptive_fields {
      xmin: 66
      ymin: 0
      xmax: 157
      ymax: 85
    }
    receptive_fields {
      xmin: 74
      ymin: 0
      xmax: 165
      ymax: 85
    }
    receptive_fields {
      xmin: 82
      ymin: 0
      xmax: 173
      ymax: 85
    }
    receptive_fields {
      xmin: 90
      ymin: 0
      xmax: 181
      ymax: 85
    }
    receptive_fields {
      xmin: 98
      ymin: 0
      xmax: 189
      ymax: 85
    }
    receptive_fields {
      xmin: 106
      ymin: 0
      xmax: 197
      ymax: 85
    }
    receptive_fields {
      xmin: 114
      ymin: 0
      xmax: 205
      ymax: 85
    }
    receptive_fields {
      xmin: 122
      ymin: 0
      xmax: 213
      ymax: 85
    }
    receptive_fields {
      xmin: 130
      ymin: 0
      xmax: 221
      ymax: 85
    }
    receptive_fields {
      xmin: 138
      ymin: 0
      xmax: 229
      ymax: 85
    }
    receptive_fields {
      xmin: 146
      ymin: 0
      xmax: 237
      ymax: 85
    }
    receptive_fields {
      xmin: 154
      ymin: 0
      xmax: 245
      ymax: 85
    }
    receptive_fields {
      xmin: 162
      ymin: 0
      xmax: 253
      ymax: 85
    }
    receptive_fields {
      xmin: 170
      ymin: 0
      xmax: 261
      ymax: 85
    }
    receptive_fields {
      xmin: 178
      ymin: 0
      xmax: 269
      ymax: 85
    }
    receptive_fields {
      xmin: 186
      ymin: 0
      xmax: 277
      ymax: 85
    }
    receptive_fields {
      xmin: 194
      ymin: 0
      xmax: 285
      ymax: 85
    }
    receptive_fields {
      xmin: 202
      ymin: 0
      xmax: 293
      ymax: 85
    }
    receptive_fields {
      xmin: 210
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 218
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 226
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 234
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 242
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 250
      ymin: 0
      xmax: 299
      ymax: 85
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 45
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 53
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 61
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 69
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 77
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 2
      xmax: 85
      ymax: 93
    }
    receptive_fields {
      xmin: 2
      ymin: 2
      xmax: 93
      ymax: 93
    }
    receptive_fields {
      xmin: 10
      ymin: 2
      xmax: 101
      ymax: 93
    }
    receptive_fields {
      xmin: 18
      ymin: 2
      xmax: 109
      ymax: 93
    }
    receptive_fields {
      xmin: 26
      ymin: 2
      xmax: 117
      ymax: 93
    }
    receptive_fields {
      xmin: 34
      ymin: 2
      xmax: 125
      ymax: 93
    }
    receptive_fields {
      xmin: 42
      ymin: 2
      xmax: 133
      ymax: 93
    }
    receptive_fields {
      xmin: 50
      ymin: 2
      xmax: 141
      ymax: 93
    }
    receptive_fields {
      xmin: 58
      ymin: 2
      xmax: 149
      ymax: 93
    }
    receptive_fields {
      xmin: 66
      ymin: 2
      xmax: 157
      ymax: 93
    }
    receptive_fields {
      xmin: 74
      ymin: 2
      xmax: 165
      ymax: 93
    }
    receptive_fields {
      xmin: 82
      ymin: 2
      xmax: 173
      ymax: 93
    }
    receptive_fields {
      xmin: 90
      ymin: 2
      xmax: 181
      ymax: 93
    }
    receptive_fields {
      xmin: 98
      ymin: 2
      xmax: 189
      ymax: 93
    }
    receptive_fields {
      xmin: 106
      ymin: 2
      xmax: 197
      ymax: 93
    }
    receptive_fields {
      xmin: 114
      ymin: 2
      xmax: 205
      ymax: 93
    }
    receptive_fields {
      xmin: 122
      ymin: 2
      xmax: 213
      ymax: 93
    }
    receptive_fields {
      xmin: 130
      ymin: 2
      xmax: 221
      ymax: 93
    }
    receptive_fields {
      xmin: 138
      ymin: 2
      xmax: 229
      ymax: 93
    }
    receptive_fields {
      xmin: 146
      ymin: 2
      xmax: 237
      ymax: 93
    }
    receptive_fields {
      xmin: 154
      ymin: 2
      xmax: 245
      ymax: 93
    }
    receptive_fields {
      xmin: 162
      ymin: 2
      xmax: 253
      ymax: 93
    }
    receptive_fields {
      xmin: 170
      ymin: 2
      xmax: 261
      ymax: 93
    }
    receptive_fields {
      xmin: 178
      ymin: 2
      xmax: 269
      ymax: 93
    }
    receptive_fields {
      xmin: 186
      ymin: 2
      xmax: 277
      ymax: 93
    }
    receptive_fields {
      xmin: 194
      ymin: 2
      xmax: 285
      ymax: 93
    }
    receptive_fields {
      xmin: 202
      ymin: 2
      xmax: 293
      ymax: 93
    }
    receptive_fields {
      xmin: 210
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 218
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 226
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 234
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 242
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 250
      ymin: 2
      xmax: 299
      ymax: 93
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 45
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 53
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 61
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 69
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 77
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 10
      xmax: 85
      ymax: 101
    }
    receptive_fields {
      xmin: 2
      ymin: 10
      xmax: 93
      ymax: 101
    }
    receptive_fields {
      xmin: 10
      ymin: 10
      xmax: 101
      ymax: 101
    }
    receptive_fields {
      xmin: 18
      ymin: 10
      xmax: 109
      ymax: 101
    }
    receptive_fields {
      xmin: 26
      ymin: 10
      xmax: 117
      ymax: 101
    }
    receptive_fields {
      xmin: 34
      ymin: 10
      xmax: 125
      ymax: 101
    }
    receptive_fields {
      xmin: 42
      ymin: 10
      xmax: 133
      ymax: 101
    }
    receptive_fields {
      xmin: 50
      ymin: 10
      xmax: 141
      ymax: 101
    }
    receptive_fields {
      xmin: 58
      ymin: 10
      xmax: 149
      ymax: 101
    }
    receptive_fields {
      xmin: 66
      ymin: 10
      xmax: 157
      ymax: 101
    }
    receptive_fields {
      xmin: 74
      ymin: 10
      xmax: 165
      ymax: 101
    }
    receptive_fields {
      xmin: 82
      ymin: 10
      xmax: 173
      ymax: 101
    }
    receptive_fields {
      xmin: 90
      ymin: 10
      xmax: 181
      ymax: 101
    }
    receptive_fields {
      xmin: 98
      ymin: 10
      xmax: 189
      ymax: 101
    }
    receptive_fields {
      xmin: 106
      ymin: 10
      xmax: 197
      ymax: 101
    }
    receptive_fields {
      xmin: 114
      ymin: 10
      xmax: 205
      ymax: 101
    }
    receptive_fields {
      xmin: 122
      ymin: 10
      xmax: 213
      ymax: 101
    }
    receptive_fields {
      xmin: 130
      ymin: 10
      xmax: 221
      ymax: 101
    }
    receptive_fields {
      xmin: 138
      ymin: 10
      xmax: 229
      ymax: 101
    }
    receptive_fields {
      xmin: 146
      ymin: 10
      xmax: 237
      ymax: 101
    }
    receptive_fields {
      xmin: 154
      ymin: 10
      xmax: 245
      ymax: 101
    }
    receptive_fields {
      xmin: 162
      ymin: 10
      xmax: 253
      ymax: 101
    }
    receptive_fields {
      xmin: 170
      ymin: 10
      xmax: 261
      ymax: 101
    }
    receptive_fields {
      xmin: 178
      ymin: 10
      xmax: 269
      ymax: 101
    }
    receptive_fields {
      xmin: 186
      ymin: 10
      xmax: 277
      ymax: 101
    }
    receptive_fields {
      xmin: 194
      ymin: 10
      xmax: 285
      ymax: 101
    }
    receptive_fields {
      xmin: 202
      ymin: 10
      xmax: 293
      ymax: 101
    }
    receptive_fields {
      xmin: 210
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 218
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 226
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 234
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 242
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 250
      ymin: 10
      xmax: 299
      ymax: 101
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 45
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 53
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 61
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 69
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 77
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 18
      xmax: 85
      ymax: 109
    }
    receptive_fields {
      xmin: 2
      ymin: 18
      xmax: 93
      ymax: 109
    }
    receptive_fields {
      xmin: 10
      ymin: 18
      xmax: 101
      ymax: 109
    }
    receptive_fields {
      xmin: 18
      ymin: 18
      xmax: 109
      ymax: 109
    }
    receptive_fields {
      xmin: 26
      ymin: 18
      xmax: 117
      ymax: 109
    }
    receptive_fields {
      xmin: 34
      ymin: 18
      xmax: 125
      ymax: 109
    }
    receptive_fields {
      xmin: 42
      ymin: 18
      xmax: 133
      ymax: 109
    }
    receptive_fields {
      xmin: 50
      ymin: 18
      xmax: 141
      ymax: 109
    }
    receptive_fields {
      xmin: 58
      ymin: 18
      xmax: 149
      ymax: 109
    }
    receptive_fields {
      xmin: 66
      ymin: 18
      xmax: 157
      ymax: 109
    }
    receptive_fields {
      xmin: 74
      ymin: 18
      xmax: 165
      ymax: 109
    }
    receptive_fields {
      xmin: 82
      ymin: 18
      xmax: 173
      ymax: 109
    }
    receptive_fields {
      xmin: 90
      ymin: 18
      xmax: 181
      ymax: 109
    }
    receptive_fields {
      xmin: 98
      ymin: 18
      xmax: 189
      ymax: 109
    }
    receptive_fields {
      xmin: 106
      ymin: 18
      xmax: 197
      ymax: 109
    }
    receptive_fields {
      xmin: 114
      ymin: 18
      xmax: 205
      ymax: 109
    }
    receptive_fields {
      xmin: 122
      ymin: 18
      xmax: 213
      ymax: 109
    }
    receptive_fields {
      xmin: 130
      ymin: 18
      xmax: 221
      ymax: 109
    }
    receptive_fields {
      xmin: 138
      ymin: 18
      xmax: 229
      ymax: 109
    }
    receptive_fields {
      xmin: 146
      ymin: 18
      xmax: 237
      ymax: 109
    }
    receptive_fields {
      xmin: 154
      ymin: 18
      xmax: 245
      ymax: 109
    }
    receptive_fields {
      xmin: 162
      ymin: 18
      xmax: 253
      ymax: 109
    }
    receptive_fields {
      xmin: 170
      ymin: 18
      xmax: 261
      ymax: 109
    }
    receptive_fields {
      xmin: 178
      ymin: 18
      xmax: 269
      ymax: 109
    }
    receptive_fields {
      xmin: 186
      ymin: 18
      xmax: 277
      ymax: 109
    }
    receptive_fields {
      xmin: 194
      ymin: 18
      xmax: 285
      ymax: 109
    }
    receptive_fields {
      xmin: 202
      ymin: 18
      xmax: 293
      ymax: 109
    }
    receptive_fields {
      xmin: 210
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 218
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 226
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 234
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 242
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 250
      ymin: 18
      xmax: 299
      ymax: 109
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 45
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 53
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 61
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 69
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 77
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 26
      xmax: 85
      ymax: 117
    }
    receptive_fields {
      xmin: 2
      ymin: 26
      xmax: 93
      ymax: 117
    }
    receptive_fields {
      xmin: 10
      ymin: 26
      xmax: 101
      ymax: 117
    }
    receptive_fields {
      xmin: 18
      ymin: 26
      xmax: 109
      ymax: 117
    }
    receptive_fields {
      xmin: 26
      ymin: 26
      xmax: 117
      ymax: 117
    }
    receptive_fields {
      xmin: 34
      ymin: 26
      xmax: 125
      ymax: 117
    }
    receptive_fields {
      xmin: 42
      ymin: 26
      xmax: 133
      ymax: 117
    }
    receptive_fields {
      xmin: 50
      ymin: 26
      xmax: 141
      ymax: 117
    }
    receptive_fields {
      xmin: 58
      ymin: 26
      xmax: 149
      ymax: 117
    }
    receptive_fields {
      xmin: 66
      ymin: 26
      xmax: 157
      ymax: 117
    }
    receptive_fields {
      xmin: 74
      ymin: 26
      xmax: 165
      ymax: 117
    }
    receptive_fields {
      xmin: 82
      ymin: 26
      xmax: 173
      ymax: 117
    }
    receptive_fields {
      xmin: 90
      ymin: 26
      xmax: 181
      ymax: 117
    }
    receptive_fields {
      xmin: 98
      ymin: 26
      xmax: 189
      ymax: 117
    }
    receptive_fields {
      xmin: 106
      ymin: 26
      xmax: 197
      ymax: 117
    }
    receptive_fields {
      xmin: 114
      ymin: 26
      xmax: 205
      ymax: 117
    }
    receptive_fields {
      xmin: 122
      ymin: 26
      xmax: 213
      ymax: 117
    }
    receptive_fields {
      xmin: 130
      ymin: 26
      xmax: 221
      ymax: 117
    }
    receptive_fields {
      xmin: 138
      ymin: 26
      xmax: 229
      ymax: 117
    }
    receptive_fields {
      xmin: 146
      ymin: 26
      xmax: 237
      ymax: 117
    }
    receptive_fields {
      xmin: 154
      ymin: 26
      xmax: 245
      ymax: 117
    }
    receptive_fields {
      xmin: 162
      ymin: 26
      xmax: 253
      ymax: 117
    }
    receptive_fields {
      xmin: 170
      ymin: 26
      xmax: 261
      ymax: 117
    }
    receptive_fields {
      xmin: 178
      ymin: 26
      xmax: 269
      ymax: 117
    }
    receptive_fields {
      xmin: 186
      ymin: 26
      xmax: 277
      ymax: 117
    }
    receptive_fields {
      xmin: 194
      ymin: 26
      xmax: 285
      ymax: 117
    }
    receptive_fields {
      xmin: 202
      ymin: 26
      xmax: 293
      ymax: 117
    }
    receptive_fields {
      xmin: 210
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 218
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 226
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 234
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 242
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 250
      ymin: 26
      xmax: 299
      ymax: 117
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 45
      ymax: 125
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 53
      ymax: 125
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 61
      ymax: 125
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 69
      ymax: 125
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 77
      ymax: 125
    }
    receptive_fields {
      xmin: 0
      ymin: 34
      xmax: 85
      ymax: 125
    }
    receptive_fields {
      xmin: 2
      ymin: 34
      xmax: 93
      ymax: 125
    }
    receptive_fields {
      xmin: 10
      ymin: 34
      xmax: 101
      ymax: 125
    }
    receptive_fields {
      xmin: 18
      ymin: 34
      xmax: 109
      ymax: 125
    }
    receptive_fields {
      xmin: 26
      ymin: 34
      xmax: 117
      ymax: 125
    }
    receptive_fields {
      xmin: 34
      ymin: 34
      xmax: 125
      ymax: 125
    }
    receptive_fields {
      xmin: 42
      ymin: 34
      xmax: 133
      ymax: 125
    }
